tutorials/incompressible/elbow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wall-1
    {
        type            wall;
        nFaces          100;
        startFace       1300;
    }
    inlet-1
    {
        type            inlet;
        nFaces          8;
        startFace       1400;
    }
    inlet-2
    {
        type            inlet;
        nFaces          4;
        startFace       1408;
    }
    outlet
    {
        type            outlet;
        nFaces          8;
        startFace       1412;
    }
    wall-2
    {
        type            wall;
        nFaces          34;
        startFace       1420;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1836;
        startFace       1454;
    }
)

// ************************************************************************* //
