tutorials/incompressible/elbow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall-1
    {
        type            noSlip;
    }

    inlet-1
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    inlet-2
    {
        type            fixedValue;
        value           uniform (0 3 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    wall-2
    {
        type            noSlip;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
